{
    "variables_path":{
        "value": "dados/variables_p3.mat",
        "comment": "caminho das variaveis iniciais: gemometria da malha, informacao de adjacencias, campo de permeabilidade, campo de porosidade, condicoes de contorno"
    },
    "mi_w":{
        "value": 1,
        "comment": "viscosidade da agua"
    },
    "mi_o":{
        "value": 1.5,
        "comment": "viscosidade do oleo"
    },
    "nw":{
        "value": 2,
        "comment": "expoente da agua na equacao de brooks e corey"
    },
    "no":{
        "value": 2,
        "comment": "expoente do oleo na equacao de brooks e corey"
    },
    "k0o":{
        "value": 1,
        "comment": "permeabilidade relativa maxima da fase oleo"
    },
    "k0w":{
        "value": 1,
        "comment": "permeabilidade relativa maxima da fase agua"
    },
    "Swr":{
        "value": 0.2,
        "comment": "saturacao irredutivel da fase agua"
    },
    "Swor":{
        "value": 0.8,
        "comment": "Swor = 1 - (saturacao residual da fase oleo)"
    },
    "sat_tol":{
        "value": 0.00001,
        "comment": "tolerancia para o delta de saturacao - criterio de convergencia no calculo implicito da saturacao"
    },
    "max_it_sat":{
        "value": 10000,
        "comment": "quantidade maxima de iteracoes no calculo implicito da saturacao em cada passo de tempo - se as iteracoes atingirem esse valor, o codigo vai parar e informar que a saturacao nao convergiu nas iteracoes de Newton Raphson"
    },
    "max_vpi":{
        "value": 0.75,
        "comment": "valor maximo do volume poroso injetado - criterio de parada da simulacao"
    },
    "max_wor_ratio":{
        "value": 3,
        "comment": "valor maximo da razao agua oleo de producao - criterio de parada da simulacao"
    },
    "cfl":{
        "value": 4,
        "comment": "valor utilizado para calcular o passo de tempo baseado na condicao de estabilidade de Courant-Friedrichs-Lewy (CFL)"
    },
    "delta_for_local_sat_tolerance": {
        "value": 100,
        "comment": "valor maximo da diferenca entre dois erros consecutivos no calculo implicito da saturacao. caso esse valor seja ultrapassado o loop eh reiniciado com o passo de tempo reduzido pela metade"
    },
    "max_it_for_local_loop_sat":{
        "value": 20,
        "comment": "valor maximo de iteracoes no calculo implicito da saturacao para atingir a convergencia. caso a convergencia nao seja atingida nessa quantidade de iteracoes o loop eh reiniciado com o passo de tempo reduzido pela metade."
    },
    "loops_for_save":{
        "value": 501,
        "comment": "define a cada quantos loops o arquivo com os dados da simulacao sera salvo"
    }
}